### HomeWork #1, Numpy

### task_#1

In [50]:
import numpy as np

a = np.array([[1,2,3,3,1], [6,8,11,10,7]]).T
mean_a = np.mean(a, axis = 0)
print(mean_a)

[2.  8.4]

### task_#2

In [43]:
a_centered = np.vstack((a[:, 0] - mean_a[0], a[:, 1] - mean_a[1])).T
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

### task_#3

In [46]:
a_centered_sp = a_centered[:, 0].dot(a_centered[:, 1])
a_centered_sp /= (a_centered.size - 1)
print(a_centered_sp)

0.8888888888888888

### task_#4

In [82]:
#?
np.cov(a.T)

array([[1. , 2. ],
       [2. , 4.3]])

### HomeWork_#1, Pandas

### task_#1

In [101]:
import pandas as pd

authors = pd.DataFrame({'author_id' : [1,2,3], 'author_name': ['Тургенев', 'Чехов', 'Островский']}, columns = ['author_id', 'author_name'])

book = pd.DataFrame({'author_id' : [1, 1, 1, 2, 2, 3, 3], 'book_title' : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290]})

### task_#2

In [111]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### task_#3

In [156]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### task_#4

In [192]:
authors_stat = pd.DataFrame({'author_name' : [], 'min_price' : [], 'max_price' : [], 'mean_price' : []})
for x in authors_price['author_name'].unique():
    tmp = authors_price.loc[authors_price['author_name'] == x].describe()
    authors_stat = authors_stat.append(pd.DataFrame({'author_name' : [x], 'min_price' : [tmp.loc['min', 'price']], 'max_price' : [tmp.loc['max', 'price']], 'mean_price' : [tmp.loc['mean', 'price']]}))
authors_stat.reset_index(inplace = True) #потому что индексы каждый раз создавались равные нулю
authors_stat.drop('index', axis = 1, inplace = True) #дропаем старые индексы
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев      300.0      450.0  366.666667
1       Чехов      450.0      500.0  475.000000
2  Островский      290.0      370.0  330.000000

### task_#5

In [213]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
book_info = pd.pivot_table(authors_price, values = 'price', index = 'author_name', columns = 'cover', aggfunc = 'sum').fillna('0')
book_info.to_pickle('book_info.pkl')
book_info2 = pd.read_pickle('book_info.pkl')
book_info.equals(book_info2)

True